УТ_для_edt/src/Catalogs/смартАлгоритмыПроверки/смартАлгоритмыПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартАлгоритмыПроверки</name>
  <comment>#Б-3164 смарт: Лопато 20.05.2025 //Печать договора из Заказа клиента. Функциональное описание новой обработки.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВыражениеУсловия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКомбинацииУсловий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаУсловия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаданияУсловия</name>
    <type>
      <types>EnumRef.смартСпособыЗаданияУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/смартСпособыЗаданияУсловия/смартСпособыЗаданияУсловия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСпособыЗаданияУсловия</name>
  <comment>#Б-3164 смарт: Лопато 20.05.2025 //Печать договора из Заказа клиента. Функциональное описание новой обработки.</comment>
  <enumValues>
    <name>ВРежимеКонструктора</name>
  </enumValues>
  <enumValues>
    <name>НаВстроенномЯзыке</name>
  </enumValues>
  <enumValues>
    <name>КомбинацияИзДругихУсловий</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартАлгоритмыПроверки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПредставлениеОтбора) 
			И СпособЗаданияУсловия = Перечисления.смартСпособыЗаданияУсловия.КомбинацияИзДругихУсловий Тогда
	
		КомпоновщикУсловий = Новый КомпоновщикНастроекКомпоновкиДанных;
		
		СхемаКомпоновкиДанных = Справочники.смартАлгоритмыПроверки.ПолучитьМакет("Условия");
		
		Настройки = НастройкаКомбинацииУсловий.Получить();
		Если Настройки = Неопределено Тогда
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		КонецЕсли;
		
		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
		КомпоновщикУсловий.Инициализировать(ИсточникНастроек);
		КомпоновщикУсловий.ЗагрузитьНастройки(Настройки);
		
		ПредставлениеОтбора = Строка(КомпоновщикУсловий.Настройки.Отбор);
		
		ПредставлениеОтбора = СтрЗаменить(ПредставлениеОтбора, "( ", "(");
		ПредставлениеОтбора = СтрЗаменить(ПредставлениеОтбора, " )", ")");
		
	ИначеЕсли Не ЗначениеЗаполнено(ПредставлениеОтбора) И 
		СпособЗаданияУсловия = Перечисления.смартСпособыЗаданияУсловия.ВРежимеКонструктора Тогда	
		
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
		
		ИндексЗначенияПеречисления = Перечисления.ТипыОбъектов.Индекс(ТипОбъекта);
		ИмяЗначенияПеречисления = Метаданные.Перечисления.ТипыОбъектов.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		
		СхемаКомпоновкиДанных = Справочники.смартАлгоритмыПроверки.ПолучитьМакет(ИмяЗначенияПеречисления);
		
		Настройки = НастройкаУсловия.Получить();
		Если Настройки = Неопределено Тогда
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		КонецЕсли;

		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
		Компоновщик.Инициализировать(ИсточникНастроек);
		Компоновщик.ЗагрузитьНастройки(Настройки);
		
		ПредставлениеОтбора = Строка(Компоновщик.Настройки.Отбор);
		
		ПредставлениеОтбора = СтрЗаменить(ПредставлениеОтбора, "( ", "(");
		ПредставлениеОтбора = СтрЗаменить(ПредставлениеОтбора, " )", ")");
		
	КонецЕсли;	
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
